CRNBuilder/data/Sandia_flame_D/case/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<scalar> 
113400
(
0
0
4.0188952e-23
4.4509056e-22
0
-6.5674784e-22
8.3429202e-22
0
...
)
;

boundaryField
{
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    fuelinlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
28
(
0
0
2.9202109e-22
0
0
0
-8.9852642e-22
0
...
)
;
    }
    innerwall
    {
        type            calculated;
        value           nonuniform List<scalar> 2(0 -6.5256003e-21);
    }
    pilotinlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0
0
0
0
0
0
0
0
...
)
;
    }
    outerwall
    {
        type            calculated;
        value           nonuniform List<scalar> 2(1.537226e-20 0);
    }
    airinlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
180
(
0
-1.6929593e-20
0
1.6034715e-20
0
-1.5190769e-20
1.4786884e-20
0
...
)
;
    }
    leftside
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
252
(
0
1.1764346e-23
-2.9202109e-22
0
0
9.977257e-22
8.9852642e-22
0
...
)
;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
