CRNBuilder/data/Sandia_flame_D/case/0/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];


internalField   nonuniform List<scalar> 
113400
(
6.5936028e-13
1.9780808e-12
3.2968014e-12
4.615522e-12
5.9342425e-12
7.2529631e-12
8.5716836e-12
9.8904042e-12
...
)
;

boundaryField
{
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    fuelinlet
    {
        type            calculated;
        value           uniform 0;
    }
    innerwall
    {
        type            calculated;
        value           uniform 0;
    }
    pilotinlet
    {
        type            calculated;
        value           uniform 0;
    }
    outerwall
    {
        type            calculated;
        value           uniform 0;
    }
    airinlet
    {
        type            calculated;
        value           uniform 0;
    }
    leftside
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
