CRNBuilder/data/Sandia_flame_D/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    front
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          113400;
        startFace       226098;
    }
    back
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          113400;
        startFace       339498;
    }
    fuelinlet
    {
        type            patch;
        nFaces          28;
        startFace       452898;
    }
    innerwall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2;
        startFace       452926;
    }
    pilotinlet
    {
        type            patch;
        nFaces          40;
        startFace       452928;
    }
    outerwall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2;
        startFace       452968;
    }
    airinlet
    {
        type            patch;
        nFaces          180;
        startFace       452970;
    }
    leftside
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          450;
        startFace       453150;
    }
    outlet
    {
        type            patch;
        nFaces          252;
        startFace       453600;
    }
    axis
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       453852;
    }
)

// ************************************************************************* //
